src/AmazonPaymentBundle/Tests/fixtures/refund/declined-ProcessingFailure.xml

<RefundResponse xmlns="http://mws.amazonservices.com/schema/OffAmazonPayments/2013-01-01">
    <RefundResult>
        <RefundDetails>
            <AmazonRefundId>P01-1234567-1234567-0000003</AmazonRefundId>
            <RefundReferenceId>test_refund_1</RefundReferenceId>
            <SellerRefundNote>Lorem ipsum</SellerRefundNote>
            <RefundType>SellerInitiated</RefundType>
            <RefundAmount>
                <CurrencyCode>USD</CurrencyCode>
                <Amount>94.50</Amount>
            </RefundAmount>
            <FeeRefunded>
                <CurrencyCode>USD</CurrencyCode>
                <Amount>0</Amount>
            </FeeRefunded>
            <RefundStatus>
                <State>Declined</State>
                <LastUpdateTimestamp>2012-11-07T19:10:16Z</LastUpdateTimestamp>
                <ReasonCode>ProcessingFailure</ReasonCode>
                <ReasonDescription>REASON DESCRIPTION</ReasonDescription>
            </RefundStatus>
            <CreationTimestamp>2012-11-05T19:10:16Z</CreationTimestamp>
        </RefundDetails>
    </RefundResult>
    <ResponseMetadata>
        <RequestId>b4ab4bc3-c9ea-44f0-9a3d-67cccef565c6</RequestId>
    </ResponseMetadata>
</RefundResponse>